"""
Автор: Лянгинен Илья Борисович
Тема ВКР: Разработка системы мониторинга и анализа KPI сотрудников организации
с использованием методов машинного обучения.

Назначение файла:
main.py является точкой входа в приложение.
Именно этот файл должен запускать программный продукт.
"""


def main():
    """
    Главная функция приложения.

    На текущем этапе она используется как стартовая точка проекта.
    Позже здесь будет запускаться графический интерфейс системы.
    """
    print("KPI Monitor ML")
    print("Система мониторинга и анализа KPI сотрудников организации")
    print("Старт приложения выполнен успешно.")


if __name__ == "__main__":
    main()